#+PROPERTY: header-args:shell :session test :results output pp

* add new shortcodes

The current file is =shortcodes-uniq.txt=.
Let’s just give it a better name.

Now let’s add the new shortcodes.

First, let’s count the lines of each one:

#+BEGIN_SRC shell
# NEW=~/shortcodes.txt
# OLD=~/sci/100daysofpractice-dataset/shortcodes/shortcodes.txt

# wc -l $NEW
# wc -l $OLD
#+END_SRC

#+RESULTS:
: 
: 449851 /home/rafa/shortcodes.txt
: 256100 /home/rafa/sci/100daysofpractice-dataset/shortcodes/shortcodes.txt

Now concatenate:

#+BEGIN_SRC shell
# cat ${NEW} >> ${OLD}
#+END_SRC

#+RESULTS:

Count the lines:

#+BEGIN_SRC shell
# wc -l ${OLD}                    # 
#+END_SRC

#+RESULTS:
: 705951 /home/rafa/sci/100daysofpractice-dataset/shortcodes/shortcodes.txt

OK.

Now uniquify:

#+BEGIN_SRC shell
wc -l shortcodes.txt
#+END_SRC

#+RESULTS:
: 450092 shortcodes.txt

This means that the old file had some extra shortcodes (possibly posts that were deleted before the new shortcodes were searched).

OK, let’s release it!
